{
  "status": "success",
  "totalResults": 384,
  "results": [
    {
      "article_id": "27c4a3511a451098d0882f6c8d9aa9b6",
      "title": "Age of AI: India reproducing a jobless generation or set to become the Global Talent Capital?",
      "link": "https://www.expresscomputer.in/artificial-intelligence-ai/age-of-ai-india-reproducing-a-jobless-generation-or-set-to-become-the-global-talent-capital/104852/",
      "keywords": [
        "Artificial Intelligence (AI)",
        "Guest Blogs",
        "News",
        "AI",
        "Global Talent Capital"
      ],
      "creator": [
        "Express Computer"
      ],
      "video_url": null,
      "description": "By Mayank Kumar, Co-founder and MD, upGrad In recent years, India’s talent landscape has transformed significantly. Previously known as a hub for cost-effective IT outsourcing, India now embraces cutting-edge technologies […] The post Age of AI: India reproducing a jobless generation or set to become the Global Talent Capital? appeared first on Express Computer.",
      "content": "By Mayank Kumar, Co-founder and MD, upGrad In recent years, India’s talent landscape has transformed significantly. Previously known as a hub for cost-effective IT outsourcing, India now embraces cutting-edge technologies like data science, AI, ML, and emerging innovations such as generative AI, GPT, Prompt Engineering, and Dall/Mid journey. Technology is transforming not only how we study but also the skills needed to power our future economy. India’s tech talent pool is adapting and upskilling to meet new demands, showcasing remarkable potential for global technology innovations. India boasts the world’s largest youth population with the working-age population projected to reach 68.9% of the total population by 2030. A recent report indicates that India has the second largest pool of highly-skilled AI, machine learning and big data talent after the US producing 16% of the world’s AI talent pool. These figures, coupled with the rise of online education, fuel optimism and position India as a global talent and skilling capital. To unlock the untapped potential of our large youth population, we aim to achieve a 50% gross enrolment ratio (GER) in higher education, doubling the current rate of 25-30%. Online education and degrees will play a key role in this transition. The pandemic transformed learning, emphasizing the significance of innovation-led practical education. Recruiters now seek agile and market-ready talent capable of anticipating market conditions and leveraging niche technologies for business success. To address this demand, universities in India partnered with Edtech companies to create a comprehensive learning ecosystem. This collaboration aims to equip graduates with the necessary theories, hands-on training, and essential “power” skills, enhancing their employability quotient and boosting overall employment opportunities in the country. The rise of Data Science, Artificial Intelligence, and Machine Learning has reshaped the global skill landscape. Concurrently, the growing popularity of Generative AI or ChatGPT among non-technical professionals has led to an increased demand for global MBA programs that provide modules covering these specialized areas. Yet, the high cost of skill-based education acts as a major deterrent, causing many individuals to postpone pursuing it unless faced with compelling incentives such as low or no increment, lack of promotion, or a mismatch between existing skills and future opportunities. According to a World Economic Forum report, the global market churn is projected to reach 23% by 2027, with 69 million new jobs created and 83 million jobs eliminated. With the rapid emergence of new-age job roles and the impact of AI, individuals will need to update their skillsets every 1 or 2 years to remain relevant in the workforce. A robust government or organizational incentive can help India build a diverse talent pipeline. Encouraging organizations to invest in employee upskilling and promoting individual responsibility for professional development is crucial. A tax incentive scheme, similar to 80CC for insurance/ELSS investments, can motivate investments in continuous learning. India has the potential to become a talent hub for digital, care, and teaching economies, exemplified by the success in the IT sector. To seize opportunities in healthcare and education, a friendlier visa regime for Indian talent is vital. Leveraging our large teacher population, India can offer mentoring and teaching solutions globally, supported by technology. There’s a paradigm shift happening as professionals invest in upskilling themselves, and younger professionals turn to Bootcamps and short-format courses for instant hard skills. Learning preferences have expanded beyond Data Science to include niche competencies like ChatGPT and Generative AI, making Edtech a popular learning partner. To democratize education, we encourage universities to adopt online platforms and maximize their reach globally. Supporting Middle Eastern, Southeast Asian, and African universities with quality online learning can position India as the “Teaching Capital of the World,” empowering its large youth population to dominate the future job market. Strengthening partnerships among universities, offline institutes, and Edtech companies will further enhance India’s talent ecosystem and elevate its global standing. India today has a unique opportunity to leverage its advantages and become a global talent superpower. With the surge in online education, technological advancements, and strategic policy interventions, India can emerge as a global talent and teaching powerhouse. The time to act is now!",
      "pubDate": "2023-10-23 13:39:43",
      "image_url": null,
      "source_id": "expresscomputer",
      "source_priority": 820148,
      "country": [
        "india"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "908291a40122606079727b5634e48d6b",
      "title": "Lewis Hamilton and Toto Wolff speak out on their US GP disqualification drama",
      "link": "https://economictimes.indiatimes.com/news/international/us/lewis-hamilton-and-toto-wolff-speak-out-on-their-us-gp-disqualification-drama/articleshow/104654333.cms",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Lewis Hamilton's podium finish at the United States Grand Prix was taken away due to post-race disqualification. Scrutineering checks by the FIA revealed that Hamilton's Mercedes car breached F1 regulations due to excessive wear on the rear skids. The disqualification affected the drivers' standings, with Lando Norris moving up to second place and Carlos Sainz securing a podium spot. Sergio Perez's position improved to fourth, widening the gap between Hamilton and his Red Bull rival. Williams benefited from the disqualification, with both of their drivers earning points and boosting the team's position in the constructors' championship.",
      "content": "Synopsis Lewis Hamilton's podium finish at the United States Grand Prix was taken away due to post-race disqualification. Scrutineering checks by the FIA revealed that Hamilton's Mercedes car breached F1 regulations due to excessive wear on the rear skids. The disqualification affected the drivers' standings, with Lando Norris moving up to second place and Carlos Sainz securing a podium spot. Sergio Perez's position improved to fourth, widening the gap between Hamilton and his Red Bull rival. Williams benefited from the disqualification, with both of their drivers earning points and boosting the team's position in the constructors' championship. AFP Lewis Hamilton and Charles Leclerc faced disqualification due to non-compliance with FIA regulations. In a dramatic turn of events at the United States Grand Prix, Lewis Hamilton 's podium finish was snatched away due to a post-race disqualification following scrutineering checks by the FIA. Despite crossing the line in second place behind Max Verstappen , Hamilton's Mercedes car was found to have breached F1 regulations due to excessive wear on the rear skids. A similar issue led to the disqualification of Charles Leclerc 's Ferrari as well. Expressing his disappointment, Hamilton emphasized that the disqualification should not undermine the progress made by Mercedes over the weekend. \"It is of course disappointing to be disqualified post-race, but that doesn't take away from the progress we've made this weekend,\" he said. Meanwhile, Mercedes Team Principal Toto Wolff owned up to the team's mistakes, attributing the issue to challenging setup choices during the sprint weekend, compounded by the demanding nature of the Circuit of the Americas (COTA) and the implementation of a new package. \"Set-up choices on a sprint weekend are always a challenge with just one hour of free practice – and even more so at a bumpy circuit like COTA and running a new package. In the end, all of that doesn't matter – others got it right where we got it wrong and there's no wiggle room in the rules. We need to take it on the chin, do the learning, and come back stronger next weekend,\" Wolff said. The repercussions of the disqualification extended beyond the immediate loss of points for Hamilton, who would have earned 18 crucial points, as it also impacted the drivers' standings. Lando Norris moved up to second place, while Carlos Sainz secured a spot on the podium. Sergio Perez's position improved to fourth, significantly affecting the battle for the runner-up position in the drivers' standings, with Hamilton's gap to his Red Bull rival expanding to 39 points with only four rounds left in the season. Additionally, the double disqualification had unforeseen consequences for Williams, as both of their drivers were propelled into the points positions, bolstering the team's standing in the constructors' championship. The turn of events also marked a milestone for rookie Logan Sargeant, who secured his first-ever F1 point in the process. Hamilton's disqualification, decoded Lewis Hamilton and Charles Leclerc faced disqualification due to non-compliance with FIA regulations. The specific rule that their cars violated pertained to the thickness of the rear skids, which is used to control the ride height of the cars. Running a car at a lower ride height can increase speed by generating more downforce. However, this generation of cars has shown a safety concern when running too low, resulting in a bouncing effect at high speeds, known as \"porpoising.\" To address this, the rules were adjusted to limit how low teams can set their cars. Mercedes, the team Hamilton drives for, did not intentionally run their cars with a lower ride height than allowed during the US Grand Prix. However, the track's rough surface caused more wear to the skids than anticipated, resulting in thinner skids than what the regulations permit. Non-compliance with the FIA scrutineering checks inevitably leads to disqualification, as was the case for Hamilton and Leclerc. The stewards, responsible for enforcing the rules, explained that they had no choice but to apply the appropriate punishment. According to the stewards, the team acknowledged that the FIA Technical Team's measurement was accurate. They attributed the high wear on the skids to the combination of the bumpy track and the condensed race schedule, which limited the time available for car setup and checks. In their decision, the stewards emphasized that it is the responsibility of the competitors to ensure compliance with the regulations at all times during an event. In this instance, the rear skid on both Hamilton and Leclerc's cars was found to be outside the specified thresholds outlined in Article 3.5.9 e) of the FIA Formula One Technical Regulations, including the allowance for wear. Therefore, the standard penalty for a breach of the Technical Regulations was applied. As the F1 regulations are highly detailed, it is crucial for teams to meticulously adhere to these rules. The incident serves as a reminder that even unintentional deviations can lead to disqualification, highlighting the importance of maintaining compliance with the regulations to ensure fair competition and safety in Formula One racing. Disclaimer Statement: This content is authored by a 3rd party. The views expressed here are that of the respective authors/ entities and do not represent the views of Economic Times (ET). ET does not guarantee, vouch for or endorse any of its contents nor is responsible for them in any manner whatsoever. Please take all steps necessary to ascertain that any information and content provided is correct, updated, and verified. ET hereby disclaims any and all warranties, express or implied, relating to the report and any content therein. Print Edition Monday, 23 Oct, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies Companies & Economy Learn more about our print edition More MNCs may Face ₹11kcr Retro Tax Demand After SC Ruling Several multinational companies headquartered in the Netherlands, Switzerland and France could be staring at retrospective tax demands for close to ₹11,000 crore on dividend income repatriated from India, following a Supreme Court ruling last week. Pushed to (Brick) Wall, Bond Investors Dial Sebi Investors have sought clarity from the Securities and Exchange Board of India (Sebi) regarding the status of rating actions by Brickwork Ratings after the firm sharply downgraded outstanding bonds of some companies including central public sector undertaking NLC India Ltd. Early Birds Report Strong Q2 Growth The initial trend in the second quarter results season is along anticipated lines with double-digit growth in net profit helped by a low base in the year-ago period and a stellar performance by banking and finance companies, offsetting a muted show by software exporters. Read More News on lewis hamilton toto wolff lewis hamilton us gp disqualification Max Verstappen Charles Leclerc Circuit of the Americas Lando Norris (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less ETPrime stories of the day Healthcare Not ‘arms and legs’, healthcare companies are using AI to make ‘brains’: health-tech expert Yan Chow 9 mins read Investing Parabolic rally propels Indian shares into expensive territory. Should investors worry? 10 mins read Environment Sikkim ruins yelp how the avalanche of development buried a lifesaver – disaster impact assessment 9 mins read Subscribe to ETPrime",
      "pubDate": "2023-10-23 13:03:12",
      "image_url": null,
      "source_id": "economictimes_indiatimes",
      "source_priority": 376,
      "country": [
        "india"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "7f889ef386566fbff4019de7c6ec0574",
      "title": "Mega Heater Reviews: Is This Portable Heater Worth My Money?",
      "link": "https://www.mid-day.com/lifestyle/infotainment/article/mega-heater-reviews-is-this-portable-heater-worth-my-money-23316027",
      "keywords": [
        "Infotainment"
      ],
      "creator": [
        "Mid-day"
      ],
      "video_url": null,
      "description": "In essence, the need for heaters extends beyond just providing warmth and includes factors relating to productivity, comfort, property preservation, health, and sustainable living. Their importance can be found in both their utilitarian qualities and the significant impact they make on people`s quality of life.",
      "content": "ADVERTISEMENT Understanding the vital function heaters play in providing a warm sanctuary highlights the need to prioritize their upkeep and integration into both residential and business environments. A heater remains a constant friend as we accept the ever-evolving dynamics of modern living, providing our comfort and well-being even in the coldest of climates. Heaters are a necessary household item since they offer comfort on chilly days and nights. Winters have evolved into a season of high costs and ineffective heating options, but this year, something is getting everyone excited. Learn the surprise switch that homes throughout the country are making. Want a warm, comfortable space in a matter of minutes? What about a heating option that won't drain your energy supplies and drive up your electricity costs? While finding effective heating has always been a wintertime tale, a new invention not only provides warmth but also completely transforms the way we think about heating. Heaters have an impact on a variety of professional contexts as well as residential settings, having a big impact on efficiency and productivity. Businesses and organizations rely significantly on energy-efficient heating systems to provide employees with a comfortable environment in colder areas. A welcoming and cozy workstation encourages productivity, creativity, and focus, improving overall job production. Additionally, maintaining a consistent temperature in industrial environments protects delicate machinery and equipment from any faults brought on by extremely low temperatures. Introducing Mega Heater, a heater unlike any other and a source of warmth that is revolutionizing the way we think about interior heating in this chilly age.Due to its cutting-edge technology, energy economy, and dependable performance, the Mega Heater brand has become more well-known in the industry. To assist you in making an informed buying decision, this in-depth Mega Heater Reviews explores the Mega Heater, its features, benefits, and drawbacks, as well as customer testimonials. Please read till the end! Mega Heater is a personal, portable space heater that uses the most advanced PTC ceramic heating technology to keep you and your family warm and comfortable during the chilly winter months. The energy-efficient portable heater, Mega Heater, is made to quickly provide your space with the warmth and comfort it needs during the colder months. The Mega Heater has cutting-edge ceramic heating components that work together to efficiently warm your room, providing a rush of comfortable warmth that chases away the bitter winter air. Mega Heater isn't your typical heating appliance; it was created out of a need for inexpensive yet effective warmth. It stands out for combining brilliant design with unrivaled heating excellence. It's not just about heating; it's about quickly turning a space into a comfortable refuge. The Mega Heater is small enough to sit on your desk, but it can blanket an entire space, transforming chilly, unwelcoming corners into cozy sanctuaries. Mega Heater provides constant, cozy warmth, eradicating the winter chill, whether you're working from home, reading, or spending time with your family. But Mega Heater's benefits don't end there. You also get efficiency that lowers your energy costs and a silent operation that doesn't disturb your peace. The Mega Heater is adaptable and can provide warmth in any space, including your living room, bedroom, or home office. You're not only ensuring comfort with this portable heating option, but you're also saving money on electricity. The ideal combination of luxurious heating without the luxurious expense. With the Mega Heater, security is of utmost importance. Numerous customers attest to its Tip-Over and Overheat Protection, so you can rest easy knowing that your safety is guaranteed. These features guarantee that the Mega Heater will automatically turn off if it tips over or if it becomes too hot, eliminating any potential risks. Your comfort is very important, and the Mega Heater makes sure that it doesn't compromise safety. Overall, the Mega Heater is the safest and is suitable for use in homes with children and pets thanks to its overheating prevention. An excellent feature of the Mega Heater is the customizable setting. With these settings, you may select the ideal temperature for your comfort. This heater can easily adapt to your tastes, whether you like a hot setting or a soft, delicate warmth. Additionally, the timer switch feature is revolutionary. You may program a personalized heating schedule so that you can enter a warm room as soon as you get home. With the Mega Heater, you won't have to wait for your space to warm up. Numerous consumers attest to the Mega heater's many amazing characteristics. The Mega Heater is perfect for a variety of uses in the United States due to its portability and small design. Instead of using multiple traditional heaters to heat different rooms, we may utilize a single mega heater, which saves money. Despite the fact that there are many portable heaters on the market right now, the Mega Heater is the best option on the American market right now because of its distinctive qualities.Below are some of the features of the Mega Heater: Mega Heat is the most intelligent plug-in space heater created to be your personal temperature companion, assuring ideal warmth wherever you are—whether it is your home office, a nice reading nook, or even your garage workshop. With Mega Heat, We're Redefining Personal Comfort. Experience quick, effective heating with the assurance that it comes with cutting-edge safety features. Simply put, with the Mega Heater's small size and quick heating technology, you can experience immediate warmth in any space. Mega Heater makes it simple to stay warm whether you're lounging in your living room or working in a chilly office. Its highly effective ceramic heating elements deliver immediate, focused warmth while using less electricity. Say goodbye to bulky, expensive heating systems and welcome quick comfort that is also cost-effective, whether it's in your bedroom or your home office. he Mega Heater was designed with cutting-edge safety features like tip-over protection and overheat protection technology. Your peace of mind is assured, even if pets or kids turn it over while running around. Mega Heater defies convention in a world where convenience frequently comes at the expense of safety. This portable heater gives families, pet owners, and office professionals alike piece of mind because it has built-in tip-over and overheat protection. The Mega Heater's portable and small design lets you turn any area into a cozy haven. Mega Heater is your quick and practical option whether you're suffering through a chilly winter night or seeking to find relief in an overly air-conditioned area. Mega Heater gives you versatility and control. Mega Heater adjusts to your lifestyle, allowing you to pick the ideal temperature and program the heater's on and off times. This feature allows you to select the perfect environment for comfort. For individualized comfort, select your preferred temperature. The Mega Heater not only offers a safer heating experience, but its silent functioning guarantees that your peace of mind is never disturbed. With a Mega Heater, you will enjoy the comfort of warmth without worrying about anything, even noise. All you have to do to use the Mega Heater is plug it into a regular electrical socket. There aren't any difficult wiring or setup steps involved. The heater can be operated with just this simple \"plug-in\" procedure. Mega Heater uses its cutting-edge ceramic heating components to effectively and efficiently warm your room. These state-of-the-art components quickly produce heat to quickly warm your environment. This plug-and-play function was created for ease, enabling consumers to take advantage of the Mega Heater's advantages without the need for complicated installation or technical knowledge. It's a method that is user-friendly, making the heater available to a variety of people and guaranteeing a hassle-free experience when setting up and operating the equipment. The user interface often has changeable temperature settings. You can regulate and adapt your heating experience thanks to this. Setting the desired temperature is simple, ensuring that your room is as cozy as you like. When you switch on your Mega heater, the ceramic heating element warms up and uses the heat oscillator to quickly and evenly spread warm air around the space. As we already noted, the heater boasts a cutting-edge heat distribution system and PTC ceramic technology that enable it to quickly adjust to the surface of the room. One option for quick heating is the Mega Heater. You wouldn't have to wait while shivering as the appliance slowly exhales warm air. Given its small size, the Mega Heater is simple to underrate by critics. However, its immensity is what truly defines its brilliance. Its elegant exterior conceals a rapid and effective heating technology reservoir. Not simply quick warmth but also evenly distributed heat, worry-free safety features, and cost-effective power usage are important. The best things do definitely come in small yet potent designs, as Mega Heater affirms. One of the main advantages of the Mega Heater is that it helps you to save money on electricity. Bring the heater inside the room you're in, rather than spending to heat the entire house or office. This winter is expected to be cold as usual, so the only solution is to purchase a reliable house heater to help beat the chill. Mega Heater has shown to be a reliable and successful remedy. Below are other benefits of using the Mega Heater: In comparison to traditional models, the Mega Heater can produce heating effects in just a few seconds. Within a short length of time, this device can increase the temperature of your space. You can unplug it after the desired temperature is attained and bring it to another room. The mega heater is incredibly portable, making it great to use anyplace in your house, on your journey, in business, or garage. Are you concerned that your children or pets might touch this heater and be burned? Stop worrying now. Kids can use Mega Heater without any worries. It is safe to use around children and pets because of the overheating prevention. Touching the Mega Heater while it is running is safe. Anyone can use this without getting wounded because it operates without heating up the body. People still enjoy vacations & travel during the winter. The Mega Heater is a transportable heater that you can take anywhere. You only need to go since you can always stay warm wherever you go. This gadget works both indoors and outdoors, such as balconies and garages. You can virtually tour every area in a home, garage, outdoor gathering, camping site, or anywhere else. Mega Heater is inexpensive, but it is also durable, unlike other inexpensive heater brands that you buy today and throw away tomorrow, squandering your money. Even though they are very simple and inexpensive, mega heaters can last you through several seasons. Mega Heater is undoubtedly constructed with high-quality materials to last a long time. The Mega Heater is very simple and easy to use, so you don't need to be a tech expert to handle or use it. Mega Heater is a high-tech gadget, yet despite this, operating it doesn't require any technical knowledge because it is quite straightforward and simple to use. Considering how much the heater accomplishes for its price, Mega Heater is an incredible value. Aside from this, there is no additional maintenance payment or associated maintenance fee after the initial payment of the sum. Additionally, a Mega Heater unit costs only $49.95. There is no increase in electricity expenses thanks to the heater's innovative energy-saving technology. Additionally, unlike air conditioners, it doesn't call for special filters. All of this contributes to lowering the heater's maintenance costs. Customers give the giant heater great marks for its quick heat-up. In the winter, the portable heater makes it simple to increase any room's temperature. Most users are not surprised that it can accomplish that; rather, they are surprised at how quickly it can do it, which makes it extremely advisable. This space heater is your winter companion if you can't stand the summertime icy noses and frequent chills. You may now save money on your energy expenses thanks to our Mega Heater. Mega heaters warm your house just as effectively as any other large heater, yet they use less energy. You can finally warm your house while saving money with the Mega Heater. Additionally, ordering now gives you the chance to receive a 50% discount on your purchase. The Mega Heater improves your quality of life by creating a warm, cozy, and welcoming environment in addition to its cost-saving and safety features. The Mega Heater guarantees a cozy living environment during the winter months, regardless of whether you're working from home, unwinding, or simply going about your everyday activities. The Mega Heater is portable, so you can quickly and easily provide comfort in any location. Ceramic elements that conserve energy Quickly and precisely heat a specific area while drastically cutting energy use. Variable Temperature Controls Equipped with tip-over and overheat protection, giving families and pet owners peace of mind. Built-in Timer with 4 Modes Tip-Over and Overheat Protection are included for security. A quiet environment is ensured by silent operation. 3 Second Heat-up Time Guaranteed 30-day money-back plus a special 50% discount during this time. Less harmful to the environment and lower carbon footprint. Affordable luxury with excellent building standards. Dependable and durable. Affordable None of the real stores or supermarkets sell the Mega Heater, so you must buy from the company’s website. There is a time limit on the 50% Special deal! Make a purchase as soon as possible. Limited in stock. . Steer clear of imitations that fall short. Click the link below to visit the official Mega Heater website for the real, paradigm-shifting Mega Heater experience. Immerse yourself in unrivaled warmth for just $49.95 with the ongoing deal. But move quickly since they're flying off the shelves. NOTE: The only place to get genuine Mega Heaters is on their official website. If you order by today, the manufacturers will ship a remote control for each heating unit for free and add it to your order for just $18.99! One-Time Offer: For just $33.72, place your order today to receive a 3-year extended replacement and protection guarantee! For three years, your product is covered by this extended warranty. It is advised to go to the Mega Heater's official website to make a purchase. By doing this, you can be certain that you will receive an authentic product and reduce your risk of purchasing a fake or a subpar replica from another online or offline market. You can make your purchase with confidence and peace of mind by using the official website's quick and dependable online purchasing service. Additionally, the website offers customer service around the clock to make sure that any questions or issues you have are swiftly resolved. Additionally, a special 50% discount deal is currently running, making the Mega Heater an even more affordable option for individuals looking for a high-quality heating solution. - I stumbled upon this heater when I was looking for a solution for our chilly basement. It's an understated powerhouse - small in size but mighty in warmth. Plus, its whisper-quiet operation means you forget it's even on. Value for money? Absolutely! - Every winter, my sunroom turns into an icebox. Enter this heater, and now it's a cozy nook all year round! Its sleek design is a bonus, ensuring it doesn't stick out like a sore thumb. Thumbs up from me! - Got this as a gift for my workshop, and boy, was it a game-changer! The chill didn't stand a chance. I especially appreciate the minimalist design and how hushed it runs. A top-notch find for sure! Anything you require to discover regarding the item and purchasing procedure but can't seem to find the solution you need? Please get in touch with their helpful team at (844) 787-6555. You can also email the company at support@getmegaheater.com, and one of their representatives will respond to you within a day. The device automatically lowers its temperature to 104F when the interior temperature exceeds 122F. In the event that the temperature exceeds 122F three times in a row, the gadget will automatically turn off. The appliance will stop heating, blow out room temperature air for 30 seconds to cool the appliance in an emergency, and turn off the power. First, get rid of whatever was causing the unit to topple over or become too hot. Step 2: Switch the heater's switch to the OFF setting. Step 3: Disconnect the heater from the wall socket and let it cool for 5–10 minutes. Step 4: Reconnect the heater's power and start it up again. If the heater keeps breaking down, you might have a malfunctioning device; stop using it and contact customer support right away to arrange for a replacement. I'm grateful. 650 to 1200 watts (low to high). 350 square foot rooms may be heated with this heater. This device is regarded as being somewhat energy-efficient. How frequently you use this heater will determine how quickly your utility costs rise. The heater's highest setting, 1200W, uses about the same amount of energy as a typical hair blow dryer. If your electricity provider charges an average of 10 cents per kilowatt-hour, the cost per hour the unit is in use would be roughly 12 cents. Please get in touch with the utility company in your area for more details. In restrooms or other wet locations, most heaters shouldn't be used. Bathrooms should only employ heaters that are UL-rated for use there. The answer is that this heater is totally safe as long as the proper level of caution and care is exercised when it is in use. This entails using utmost caution whenever a heater is used by or close to kids or animals. Generally speaking, you should never leave a heater on while you are not home. Heaters generate heat; therefore, their surface may feel warm to the touch. We advise against connecting your heaters to anything besides a wall outlet. The electricity utilized by heaters, which may be more than what the timer or power strip is meant for, is the reason for this advice. We do not advise connecting heaters using adapters. Endeavor to use a wall socket for the best function. The company, a tiny startup from California, decided against hiring huge factories and paying for immoral slave labor like other companies do since they don't want to do that. They desired to keep an eye on the manufacturing process from beginning to end. Mega Heater supports providing warmth to all. They avoid unnecessary expenses, guarantee the finest quality, and pass on the savings to you by managing the entire production process. Mega Heaters are a well-known, affordable option for people looking for durable heating solutions with cutting-edge features and effective performance. Mega Heaters' commitment to safety, energy efficiency, and robust construction has solidified itself as a top brand in the heating appliance sector. Mega Heater has sophisticated ceramic heating components to swiftly warm you up while using 30% less energy than ordinary heaters. You may save money on energy expenses without sacrificing comfort in your bedroom or home office. The Mega Heater offers a flexible and affordable heating option that can be used by homeowners, renters, office workers, students, and tourists equally, thanks to its small size and low price. The Mega Heater is a leading contender in the field of heating solutions, whether your goal is to reduce your energy costs or just to enjoy a warm, comfortable space. Take advantage of the 30-day Guarantee and 50% special discount offered on the official website. With the manufacturers' website, your satisfaction is guaranteed, and you can shop confidently.",
      "pubDate": "2023-10-23 12:28:17",
      "image_url": "https://images.mid-day.com/images/images/2023/oct/MEGA-HEATER23103_d.jpg",
      "source_id": "mid_day",
      "source_priority": 4893,
      "country": [
        "india"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "2c76492e7e3e69b2a780963289ceb6fb",
      "title": "Tech View: Nifty breaks below 100-DMA. What traders should do on Wednesday",
      "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-breaks-below-100-dma-what-traders-should-do-on-wednesday/articleshow/104652519.cms",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "In terms of Open Interest (OI) data, the highest OI on the call side was observed at 19,600, followed by the 19,500 strike prices. On the put side, the highest OI was at the 19,000 strike price.",
      "content": "Synopsis In terms of Open Interest (OI) data, the highest OI on the call side was observed at 19,600, followed by the 19,500 strike prices. On the put side, the highest OI was at the 19,000 strike price. ETMarkets.com Nifty today ended 261 points lower to fall below its 100-DMA and form a long bear candle on the daily chart. The short-term trend of Nifty continues to be negative. Having moved below the support of 19,330, one may expect the Nifty to slide down to 18,825 levels-200 day EMA in the near term. Any attempt of upside bounce could encounter resistance around 19,400 levels, said Nagaraj Shetti, Technical Research Analyst, HDFC Securities. In terms of Open Interest (OI) data, the highest OI on the call side was observed at 19,600, followed by the 19,500 strike prices. On the put side, the highest OI was at the 19,000 strike price. The market will be closed on Tuesday on account of Dussehra. What should traders do? Here’s what analysts said: Jatin Gedia, Sharekhan by BNP Paribas On the daily charts, we can observe that the Nifty has breached the previous swing low of 19333 it touched in the first week of October and has closed below that indicating a breakdown. Weekly, daily, and hourly momentum indicators have a negative crossover which is a sell signal. Thus, both price and momentum indicators suggest a further decline. On the downside, Nifty is likely to drift towards 19,000 from a short-term perspective. On the way up 19,500 - 19,530 shall act as an immediate hurdle zone as per the principle of role reversal. Shrikant Chouhan, Kotak Securities For day traders, 19,400 would be the key resistance level, below which the index could slip till 19,200-19,175. On the other hand, above 19,400 we could see a quick technical bounce back till 19,450-19,500. Kunal Shah, Senior Technical & Derivative analyst at LKP Securities The bears have maintained a strong grip on the index, resulting in significant selling pressure. This pressure led to a breakdown of the key support level at 19,500. With the support at 19,500 breached, the next significant support level was at 19,200. If the index fails to sustain above this level, it may experience further declines toward the 19,000-18,800 range.The overall sentiment for the index remains bearish. As long as the index stays below the 19,600 mark, the view remains bearish, and any upward movements are viewed as selling opportunities. (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times) Connect with Experts - Wealth creation made easy Print Edition Monday, 23 Oct, 2023 Experience Your Economic Times Newspaper, The Digital Way! Read Complete Print Edition » Front Page Pure Politics Companies Companies & Economy Learn more about our print edition More MNCs may Face ₹11kcr Retro Tax Demand After SC Ruling Several multinational companies headquartered in the Netherlands, Switzerland and France could be staring at retrospective tax demands for close to ₹11,000 crore on dividend income repatriated from India, following a Supreme Court ruling last week. Pushed to (Brick) Wall, Bond Investors Dial Sebi Investors have sought clarity from the Securities and Exchange Board of India (Sebi) regarding the status of rating actions by Brickwork Ratings after the firm sharply downgraded outstanding bonds of some companies including central public sector undertaking NLC India Ltd. Early Birds Report Strong Q2 Growth The initial trend in the second quarter results season is along anticipated lines with double-digit growth in net profit helped by a low base in the year-ago period and a stellar performance by banking and finance companies, offsetting a muted show by software exporters. Read More News on nifty50 stock market analysis stock market tech view nifty bank nifty today sensex crash (What's moving Sensex and Nifty Track latest market news , stock tips and expert advice on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Download The Economic Times News App to get Daily Market Updates & Live Business News. Top Trending Stocks: Sensex Today Live , SBI Share Price , Axis Bank Share Price , HDFC Bank Share Price , Infosys Share Price , Wipro Share Price , NTPC Share Price ... more less Pick the best stocks for yourself Powered by Weekly Top Picks: Eight stocks with consistent score improvement and upside potential of up to 40% 9 mins read 4 stocks with 5 % to 8.87% dividend yields and continuous dividend payments for 7 years 7 mins read Weekly Top Picks: Seven large & mid caps with consistent score improvement and upside potential of up to 42% 9 mins read What do Q2 LIC results indicate for other Insurance companies? Two Life and 3 non-life Insurance players with “buy” and “strong buy” ratings 3 mins read Large cap stocks with upside potential of more than 25% 4 mins read 5 stocks for a high dividend yielding portfolio 8 mins read Eight midcap stocks, 2 with“ Strong Buy” and 6 with “Buy” recommendations with potential upside of up to 35% 7 mins read Six high ROE and low PEG ratio stocks, right combination for wealth creation 8 mins read View More Stories Subscribe to ETPrime",
      "pubDate": "2023-10-23 11:50:39",
      "image_url": null,
      "source_id": "economictimes_indiatimes",
      "source_priority": 376,
      "country": [
        "india"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "a49f154cc739d68696e03d21fa5498c6",
      "title": "ChopWatts Reviews: Does This Energy Saver Really Work?",
      "link": "https://www.mid-day.com/lifestyle/infotainment/article/chopwatts-reviews-does-this-energy-saver-really-work-23316020",
      "keywords": [
        "Infotainment"
      ],
      "creator": [
        "Mid-day"
      ],
      "video_url": null,
      "description": "Dirty electricity, also known as electrical pollution or electromagnetic interference, is the presence of high-frequency electromagnetic fields (EMFs) on electrical cables in our homes and places of employment.",
      "content": "ADVERTISEMENT The need to shift away from dirty energy sources cannot be emphasized in an era characterized by rapid technology developments and rising global energy demand. Because of the negative effects of different technologies on the environment, public health, and climate change, there is an urgent need for innovative solutions to replace these sources effectively. The adoption of energy-saving devices, which not only lowers our energy consumption but also plays a critical part in the elimination of dirty energy, is a critical step in this path. The proliferation of electronic devices, energy-saving lighting, and other electrical equipment frequently brings on these EMFs. Unclean electricity is quite real and can have very negative effects despite the fact that we cannot see or feel it. Even though it cannot ionize atoms and molecules because EMF emissions, particularly those from wireless communication equipment, are not recognized as ionizing radiation (like X-rays and gamma rays), a growing body of research suggests that continuous and excessive exposure to EMF can be bad for human health. EMF filtering devices operate as a shield between people and the possibly hazardous consequences of long-term EMF exposure. These devices assist in reducing the risk of developing health problems connected with EMF exposure by reducing the strength or frequency of EMFs. This is especially crucial for persons who spend long periods of time near strong EMF-emitting sources, such as workplace spaces densely packed with electronic equipment. ChopWatts, a power-saving gadget, makes the claim that it can reduce energy use and electricity costs. The device can be employed in a variety of appliances, including air conditioners, refrigerators, televisions, and others. The inventor of the ChopWatts device claims that it can significantly reduce your electricity costs. How effective is it, though? In this ChopWatts Review, we will evaluate the ChopWatts and look at its advantages and disadvantages. To save energy, you can affix a gadget called ChopWatts to any outlet in your home or place of work. In order to lower the energy consumption of your electrical equipment, the device is designed to control the flow of electricity. The gadget controls the voltage and current in your electrical system to function. ChopWatts' EMF filters are a problem for power companies. It's a little, low-cost gadget, but it could be the game-changer you hoped for. Despite being an affordable gadget, ChopWatts has the capability to prevent needless power loss and clean up contaminated electricity. The fact that information is readily available online in this day and age is a blessing. Large energy companies would have already taken clandestine action to eliminate it if it didn't exist. This is because of the significant decrease in electricity costs that any home that uses it experiences. Since ChopWatts is not typically seen in retail settings, it is readily available and can be ordered straight from the firm online. In the past, it's likely that you were billed for both the electricity you actually consumed and the energy your home wasted. Sometimes, the amount of energy wasted exceeds the amount of electricity used. Ultimately, this leads to a large electrical bill. Users claim that ChopWatts is highly effective at cutting costs and is made to help you prevent this. Numerous people have ChopWatts energy-saving appliances in their houses. This serves as an example of how energy-saving solutions can reduce energy waste and energy costs. ChopWatts' user base is growing at an alarming rate as more people become aware of its value and the brutality of large energy companies. The ChopWatts shield your equipment from electrical damage in addition to saving you money on electricity. Overall, ChopWatts can benefit both home and commercial settings in a number of ways. ChopWatts can improve the dependability and quality of your electrical system while reducing the risk of health problems brought on by dirty electricity. If you are concerned about the quality of your electrical system or have experienced problems with electrical pollution or interference, you should think about installing a ChopWatts in your home or place of business to improve the performance of your entire electrical system and protect your expensive electronic equipment. Numerous ChopWatts reviews claim that ChopWatts is the best and most advanced electricity control system currently in use. The ChopWatts device has the following features: Installation is straightforward with the ChopWatts device. Any open outlet in your house or place of business will do. If you're unsatisfied with your Chop Watts, just return it for a full refund within 60 days of delivery. By using the company's straightforward purchase method, you may get Chop Watts delivered right away and promptly set up at your location! The manufacturers' website is also very secure so that you can make your purchase without fear. By reducing the energy use of your appliances, you may reduce your carbon footprint and make your home more environmentally friendly. This is made possible by the ChopWatts device. No specialist expertise or skills are needed to use the device. We all know that hiring an electrician can be pretty expensive, so the manufacturers of the ChopWatts have made it possible to use this masterpiece without having to pay anyone a dime! : According to certain studies, EMI from dirty power can be harmful to your health. Although there has yet to be much research, you don't want to take a chance. The usage of an EMI filter is the most efficient way to lessen this health risk. One of the best filters now on the market seems to be the ChopWatts EMI filter. By clearing out the negative energy in your home, ChopWatts will shield you from any health problems, known or unknown. This ChopWatts Review would be very long if we were to describe all the benefits of using this energy saver. Contrarily, ChopWatts excels in what it does and has much to offer. The Chop Watts provides dependable, environmentally friendly electricity for your home and office. There will be less wasted energy in your home, a boost in current efficiency, less dirty electricity, and a significant decrease in energy consumption. Works with various appliances, including air conditioners, refrigerators, televisions, and others, making it a versatile option for all your devices. The electricity bill is one of our favorite ways of reducing monthly costs. In recent years, the cost of electricity has gradually increased, sometimes owing to additional elements, the majority of which are outside the consumers' control. However, dirty electricity significantly affects electricity costs. By letting dirty power, you squander energy you didn't need but still have to pay for. If you are tired of paying exorbitant bills for electricity usage, ChopWatts might save your life. It can clean up contaminated power and reduce energy waste. There won't be any more energy lost on your account as a result. Your bills will likely be much reduced after you start utilizing this device. You may cut your electricity expenditures using the ChopWatts device, which can result in significant financial savings for many families. By reducing the energy use of your appliances, the ChopWatts gadget can help you save money on your electricity bills. The device can help shield your appliances from damaging power surges and spikes. The ChopWatts device is made of high-quality components and is designed to last for years. It's straightforward to utilize ChopWatts. ChopWatts, unlike many other energy-saving techniques, does not necessitate complex programming or technical understanding. Plug your ChopWatts energy saver into a power outlet after you've unpacked it. A green light will come on when you plug it in to show that everything is operating as it should. It takes less than 20 seconds to complete the process. For a more detailed procedure: Decide on a location that is as close as you can get to your breaker box. If you have more than one, install each ChopWatts on a different breaker. The best results will be obtained if you use them on several floors or in various areas of your home or business. A green light will turn on when your ChopWatts is plugged into a live outlet and starts to filter and stabilize the electrical current in your home or office. If there isn't a green light, check if the outlet is turned on or if a breaker box is nearby. The standard home or business will take around 2-3 weeks to stabilize the current and filter out the dirty power, depending on the size of the building, the age of the electric system/breaker box, and other considerations. Before anticipating results, please give Chop Watts 6–8 weeks to work its magic. Your home's size will determine how many ChopWatts energy savers you need. It is advised to use one ChopWatt for a 1500-square-foot apartment. If your home is between 1500 and 3000 square feet in size, using two ChopWatts energy savers is recommended. Three ChopWatts devices are advised in a home that is 3000 square feet or larger. More than one device should never be connected to one location at once. Since it is more practical, many people use the area closest to the circuit breaker box. You are not obligated to do this, though. As long as you're roughly in the middle, it's acceptable. This Chopwatts won't be harmed by being unplugged, but it will operate more slowly. ChopWatts takes some time to completely clean the dirty wiring in your home, much like with water and air filters. It can take four to six weeks to complete this. ChopWatts is entirely secure to disconnect from, albeit not recommended because once it is done, dirty electricity will start to build up again, leaving you right back where you were. The following are some of the Pros in favor of the ChopWatts: No pricey installation Stabilize the Electrical Current in Your Home or Office Quickly and Easily Lowers the temperature of the electricity Cleans the power lines Reduce the use of harmful and dirty electricity in your home or office Instant Power Compensation Good for the Ecosystem Guards against electric shock and harmonic wave absorption Installation is easy and maintenance-free! Works reliably and safely in any office or home How to Protect and Extend the Life of Your Electronics and Appliances. 60-Day money-back guarantee There are several benefits to the ChopWatts device, but there are also some drawbacks to be aware of: Some customers may find the product's exclusivity to online sales inconvenient. Only accessible online from the manufacturer's website. For things that most businesses anticipate would be extremely important to the majority of customers, they typically charge extravagant prices. The designers of ChopWatts Energy Saver, on the other hand, chose a different approach. It is, therefore, inexpensive for those who actually need it. One-Time Offer: Place your order today and receive a 3-year extended Warranty replacement and protection warranty for only $9.80. This extended warranty covers your product for a period of three years. One-Time Offer: Opt out of Smart Retailing Loyalty Superstore for 45 days at no extra cost today. Cash-back rebates and discounts are available at thousands of shops worldwide. The first 45 days are free to test. Then, membership is only $9.95 monthly, billed to the card provided. Cancel at any time by visiting https://www.shopchopwatts.com/dtc/. As you can see, the ChopWatts energy saver is currently significantly less expensive. Additionally, delivery to addresses in the USA is free. The best time to buy yours is right now because it would be insane to pass up this fantastic chance. You can easily and quickly do this work by clicking the following link. The ChopWatts are simply available for purchase on the company website. Because ChopWatts is so well-known, several scammers have created subpar goods to pass themselves off as ChopWatts. You can be sure that what you are paying for is genuine if you purchase from the company's official website. Additionally, time-limited 50% discounts and other special offers that might be issued will be eligible for you. CONTACT US The manufacturers are always eager and would appreciate hearing from you. The crew is always on hand to answer any questions about these product(s), the suppliers, the cost, or anything else. Reach them at: support@shopchopwatts.com Call us at (888) 490-5590 to get in touch. Time Zone: Pacific Standard 7 AM to 5 PM OFFICE ADDRESS: Cute Watts 90101 Dover, DE; 8 The Green, Ste A If you’re skeptical, I feel sorry for you. Chop Watts has really made something special here. I’m not entirely sure how it works, but the savings are REAL! Alright, so I bought 3 of these. Put one in my kitchen, one in the bedroom, and one in our living room. After six months, I can confidently say that we’re easily saving at least $50 per month. Chop Watts is a no-brainer. You want to save money each month? Buy a few of these, and you’re all set. Absolutely. Chop Watts has been accepted by all 50 states, including Hawaii and Alaska, and is now being utilized to stabilize power. It definitely will. The ChopWatts will undoubtedly apply to any structure with power. Included are apartments, establishments, bungalows, and trailers. Chopwatts may be used almost anywhere there is electricity. Absolutely. Chop Watts is the only power factor device that is both UL- and RoHS-approved, making it the safest power factor product on the market. For the optimum EMF filtering effects, it is suggested that you install 1 Chop Watt for every 1500 square feet of space. Using more than is recommended won't change the results. Don't worry about it. If the power goes out, you won't need to filter the entire house again. No new, dirty EMF electricity enters the house when the power is down. As a result, your Chop Watts will continue to filter as soon as the power is back on as long as you keep it plugged in. There aren't any dangers we spoose. Using the Chop Watts device with solar power installations should be safe. Because the latest version of ChopWatts was only introduced this year and hasn't been thoroughly tested on solar electricity systems, we don't know how well it will function with them. Your outcomes might be different from those of a non-solar system. Keep in mind that you have 60 days to return your product if you are not satisfied. Yes! The Residential Energy Stabilization (RES) regulation now allows Power Factor devices and EMF filters like Chop Watts in the USA. The outcomes will differ based on various variables, such as home size, electricity consumption, solar energy consumption, location and climate, power provider, home age, and many others. We do advise all customers to allow Chop Watts three months to filter out the hazardously unclean energy that travels through your electrical wire between the frequencies of 4 and 150 kHz. If the outcomes fall short of your expectations within the allotted time frame, email the product's creators, and they will gladly accept the unit(s) back for a complete refund. Yes. By enhancing the flow of electricity in your home, one of the fantastic benefits of using a power factor correction device like Chop Watts is that you will start using less electricity and conserving energy. We advise positioning one device in the middle of the room. Most of the time, we advise placing multiple units as far away as possible, ideally at different ends of the house. You can increase the power of the devices by doing this. Installing the equipment close to the circuit breaker is permitted but not necessary. Due to its greater convenience and discretion, most people use that location. Yes, a 5-year Standard Warranty is included with every purchase. Send it back for a free replacement if your Chop Watts device ever breaks, is damaged, or ceases to function. Send an email to support@shopchopwatts.com to report a broken or inoperable device. Making decisions without fear is possible when you know that you are safe. The Chop Watts is similar to an air or water filter. For the typical home, it takes about 4-6 weeks for Chop Watts EMF Filters to completely remove the contaminated electricity from your home. The moment you remove the filter, the dirty EMF power begins to flow again. To maximize EMF Filtering and prevent any progress from being lost, we advise leaving Chop Watts equipment plugged in at all times, even though doing otherwise is relatively safe. As soon as your Chop Watts is plugged in, the green bar will begin to light up, signaling that the gadget is operational and filtering the contaminated EMF power. Like any other filter (such as an air or water filter), Chop Watts EMF Filters need time to filter the dirty energy from your house effectively. It will take 3–4 weeks to stabilize, filter, and clean the power in the typical home. Keep in mind that the manufacturers have a 60-day refund policy. You have plenty of time to test Chop Watts and begin benefiting from it. No risk exists. No, Chop Watts is only compatible with North American 110v electrical systems. The business plans to release a 220v product version within six to twelve months. Yes. They will cancel your order and issue you a full refund as long as you do so before it is shipped (orders ship within 24 hours, except on weekends and holidays). Unfortunately, an order cannot be canceled after it has been delivered. In this instance, they will require that you return the order to them before processing your refund. The product's creators passionately believe in it and are optimistic that it will enhance the lives of all homeowners. After 60 days of use, Chop Watts promises a 100% Refund (including shipping costs) if you haven't reduced your electricity costs sufficiently to cover the cost of your purchase. They are question-free! They are confident that Chop Watts is the best power management tool available. Refund requests can only be submitted via email. Email the manufacturers at support@shopchopwatts.com for information on how to return an item and request a refund. Chop Watts Electricity is a game changer for individuals who want to improve their energy efficiency while protecting their devices and appliances. This ground-breaking technology reduces dangerous and filthy power in your home or workplace, lowering energy usage and extending the life of youar electronics. The purpose of employing EMF filtering devices is not to shun technology but to live in harmony with it. These products enable us to keep our technology lifestyle while putting our health and well-being first. This strategy encourages users to balance keeping connected and limiting potential health concerns when using technology. The effectiveness of ChopWatts can vary based on various variables, including the state of your electrical system, the types of gadgets you own, and your typical energy consumption patterns. It's essential to remember that ChopWatts is not a magic fix that will erase all of your energy costs but rather a tool that can help you improve your energy use. Many ChopWatts users claim to have saved a large amount of energy. No matter where you live or the size of your house, the ChopWatts energy saver can help you cut your electricity expenditures. When you place an order straight immediately, you can save up to 50%! By clicking the following link, which will take you to the official manufacturer's website where you can get your own at a reduced price, you will reduce the cost of your electricity! '",
      "pubDate": "2023-10-23 11:48:49",
      "image_url": "https://images.mid-day.com/images/images/2023/oct/chopwatt2310_d.jpg",
      "source_id": "mid_day",
      "source_priority": 4893,
      "country": [
        "india"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "833226e96256d186eea0181915178a61",
      "title": "Remote Health Logistics: What to Know About RPM Enablement",
      "link": "https://www.informationweek.com/software-services/remote-health-logistics-what-to-know-about-rpm-enablement",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "RPM enablement programs offer end-to-end logistics, inventory tracking, and training to let health systems carry out virtual care of chronic conditions.",
      "content": "As healthcare organizations face a shortage of up to 124,000 physicians by 2034, they’re deploying remote patient management (RPM) enablement services that can work with virtual care applications and handle tasks such as inventory tracking, logistics, and device returns. With burnout among US doctors reaching 63% in 2021, according to the American Medical Association, managed services called RPM enablement are easing the burden for healthcare workers when it comes to the logistics of remote care. RPM enablement vendors pair monitoring devices for chronic conditions such as diabetes, chronic obstructive pulmonary disease (COPD), or hypertension equipment to a tablet or smartphone. “RPM services are typically offered as a managed service to help healthcare organizations (HCOs) with the logistics of RPM,” Lynne Dunbrack, group vice president for public sector at research firm IDC, tells Information Week via email. It involves “enabling” care workflows that help reduce clinician burnout. RPM enablement goes beyond RPM to include order fulfillment, enrollment, and device setup, according to Shannon Germain Farraher, senior analyst at Forrester Research. It also enables patient education and training tools as well as managing maintenance and device replacements. Related : How AI Ethics Are Being Shaped in Health Care Today “Most major health systems in the US will have some form of RPM enablement for their virtual care platforms and programs,” Farraher tells InformationWeek via email. A key aspect of RPM enablement is integrating remote monitoring with a health system’s electronic health record (EHR) so providers can manage data as if the patients were admitted in a hospital, Farraher says. Multiple vendors have announced new RPM enablement services this year. On Oct., 4 Ricoh launched its Remote Patient Monitoring Enablement platform, which integrates virtual care programs with tasks such as inventory tracking, logistics, and device returns. Meanwhile, SalvoHealth introduced an RPM enablement program for gastrointestinal chronic conditions in August. In a blog post , Dr. Erin Hendriks, a board-certified family physician with SalvoHealth, noted how RPM goes beyond simply monitoring to enable services such as behavior change and symptom tracking. “Our comprehensive approach pairs RPM enablement with intensive, evidence-based practices in behavior change, nutrition, GI-directed psychology, and daily symptom tracking to equip patients with the means to manage symptoms and stress responses,” Hendriks wrote. The SalvoHealth enablement app-based platform includes a Class II mobile EKG device, daily reporting, and coordination with care teams to avoid escalation in symptoms. Related : The Chatbot Will See You Now: 4 Ethical Concerns of AI in Health Care How RPM Enablement Works RPM enablement allowed health systems to ramp up use of virtual care during the COVID-19 pandemic. For hospital CIOs implementing RPM, the enablement process is the “engine that makes it go,” says Jim Mooney, senior director of marketing strategy and campaigns for healthcare at Ricoh. Enablement consists of a third-party handling day-to-day management of an RPM service, which alleviates a systemic staffing shortage. The idea is to make remote monitoring more efficient with onsite managed service experts helping the care team with remote monitoring, Mooney says. Onsite help consists of operations, services, and support for remote monitoring devices. “We place the selected devices and the tablet into an RPM kit,” Mooney explains. “Based on that clinician request, we install the required software and the devices. We enter all the device details into the health systems tracking system, and we also print their patient education instructions.” Clinicians initiate RPM for a patient by opening a ticket and entering an order in an EHR. That allows a ticket to be sent to Ricoh to request a tablet or RPM device for patients. Then a device or tablet provider sends a device, and Ricoh handles device activation. The enabling process also involves powering RPM devices, installing software, tracking serial numbers, printing customer education, and delivering devices to a drop-off location or shipping them to the patient, Mooney says. Related : Why AI’s Slower Pace in Healthcare Is as It Should Be When healthcare organizations implement RPM enablement, they first verify if they are contracted for chronic care management under their insurance plans. Then they onboard patients in chronic care management programs and ship RPM devices to a patient’s home. Licensed nurses monitor patients and work with them on setting up the devices, according to Dunbrack. “Other services include troubleshooting if patients have technical issues connecting their devices, accepting returns and refurbishing devices for reuse,” Dunbrack adds. In addition to Ricoh, TytoCare’s RPM enablement solution handles logistics to reduce the stress on partners, Farraher says. Vendors such as Clear Arch also incorporate logistics management services that include patient enrollment, equipment warehousing, and enhanced tracking and notifications during shipping. Meanwhile, Optimize Systems’ Optimize Health solution also offers a full RPM enablement as part of a full patient life cycle. That includes patient identification, clinical monitoring services, onboarding and education, and device shipping. Meanwhile, Best Buy’s care-at-home platform Current Health enables RPM through the Geek Squad, Farraher notes. Top Considerations for Hospital IT Leaders When Using RPM Enablement Consider these strategies when implementing an RPM enablement program. Health systems should seek out RPM enablement firms that have detailed operational blueprints and can expedite implementation, Farraher advises. When IT leaders implement an RPM enablement program, they must get buy-in from clinicians, she says. “Any tech that impacts a clinician’s workflow needs to be sufficiently adopted by the clinician,” Farraher says. “If it’s not ‘clinician-approved,’ chances are it will not be used correctly or adopted, and ultimately the investment will not be maximized.” Also, health IT leaders should choose a vendor that offers ongoing support for an RPM enablement solution rather than a “set it and forget it” approach, Farraher suggests. “Carefully vet to see how the vendor plans to stay engaged with your team, the clinicians, and the patients, and clearly define what the communication cadence is,” Farraher says. Provide a vision for scale, Mooney advises. That means choosing a vendor for RPM enablement that can increase patient volumes over time, he says. After setting up a baseline volume of patients, health systems can add more devices and patient volume. Choose a platform that offers interoperability between the RPM platform and clinician apps, Mooney says. “They all need to speak the same language,” Mooney says. “What’s going to happen is you are going to have a bunch of different systems, each with their own learning curve and necessitating their own expertise for how to use the program. It just creates this really fractured picture, and it's a total headache.” He adds that EHRs must also be interoperable with the RPM interface. “The ability of that interface to be very tightly integrated to the EHR, that is absolutely critical to the ongoing success and sustainability of our program,” Mooney says. With data on chronic conditions being collected from a patient’s home, IT leaders must ensure that RPM solutions adhere to security and privacy policies. The National Cybersecurity Center of Excellence in the as part of the National Institute of Standards and Technology provides guidance on how to secure telehealth and RPM solutions. It covers best practices such as risk assessment and threat modeling. Cloud solutions such as Vivify Health offer user access control that includes biometrics and asset management to provision devices and transmit health data between patients and physicians securely.",
      "pubDate": "2023-10-23 11:30:00",
      "image_url": "https://eu-images.contentstack.com/v3/assets/blt69509c9116440be8/blta90f720d41350517/653184b35a8a4fd73bdf4818/virtualdoctor_DenisPutilov-AlamyStockPhoto.jpg",
      "source_id": "informationweek",
      "source_priority": 200671,
      "country": [
        "united states of america"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "dae5c50e3c8120dc5938c96eb20a7c85",
      "title": "Musk’s SpaceX Reportedly Inks Deal With EU To Launch Satellites",
      "link": "https://www.forbes.com/sites/alisondurkee/2023/10/23/musks-spacex-reportedly-inks-deal-with-eu-to-launch-satellites/",
      "keywords": [
        "Business",
        "/business",
        "Business",
        "/business",
        "Innovation",
        "/innovation",
        "Billionaires",
        "/worlds-billionaires",
        "Breaking",
        "breaking-news",
        "topline"
      ],
      "creator": [
        "Alison Durkee, Forbes Staff"
      ],
      "video_url": null,
      "description": "European officials were initially hesitant to work with the U.S.-based company, the Wall Street Journal reports.",
      "content": "Forbes Business Breaking Musk’s SpaceX Reportedly Inks Deal With EU To Launch Satellites Alison Durkee Forbes Staff Following Oct 23, 2023, 07:25am EDT | Press play to listen to this article! Got it! Share to Facebook Share to Twitter Share to Linkedin Topline SpaceX, the private rocket producer run by billionaire Elon Musk, has reached a deal with the European Space Agency to launch four navigation and communications satellites into orbit, the Wall Street Journal reports , marking the first time the European Union has partnered with the Musk-led company on a satellite containing classified information. Elon Musk attends the Viva Technology conference at the Porte de Versailles exhibition centre on ... [+] June 16 in Paris, France. Getty Images Key Facts SpaceX will launch four of the EU’s Galileo satellites from the U.S. next year in two rounds, using the company’s Falcon 9 rocket, Javier Benedicto, the European Space Agency’s director of navigation, told the Journal . The satellites enable encrypted communications between European governments and handle the bloc’s satellite navigation system. The launches will mark the first time the Galileo satellites have been sent into orbit from outside the EU in 15 years, and the Journal reports EU and U.S. officials are working together on the handling of classified information. European officials were initially opposed to using SpaceX for Galileo launches, the Journal reports, believing the bloc “shouldn’t depend on a U.S. company, launching from the U.S., to deliver critical infrastructure into space.” The change in thinking was affected by several factors, including European operators cutting ties with Russian rockets amid the war in Ukraine and technical issues with several other European rockets, according to the Journal . SpaceX has not yet responded to a request for comment, and a spokesperson for the European Space Agency told the Journal the agency is “taking all necessary steps to ensure that the Galileo constellation continues to provide outstanding services in the coming months and years.” What To Watch For The SpaceX deal will still have to be approved by the EU’s executive arm, the European Commission, as well as its member states, which officials cited by the Journal predicted would happen by the end of the year. Crucial Quote “It is a matter of robustness,” Benedicto told the Journal , noting that Galileo satellites in space right now aren’t at risk of any near-term failures. “We have 10 satellites that are ready to be launched, and those satellites should be in space, not on the ground.” Benedicto added the space agency does not believe it will use SpaceX for future Galileo launches beyond the four in this deal, however. Forbes Valuation $225.2 billion. That’s Musk’s estimated net worth as of Monday, according to Forbes ’ real-time tracker, making him the richest person in the world. Forbes values SpaceX as being worth nearly $150 billion. Tangent The SpaceX deal comes as the EU has been fighting with X, one of Musk’s other companies. The bloc announced October 13 it had launched an investigation into the social media company, formerly known as Twitter, over concerns about how it’s handled misinformation and violent content around the war in Israel since Hamas launched an attack earlier in October. The bloc has concerns that X is in violation of the EU’s Digital Service Act, which could result in serious sanctions, such as fines of up to 6% of the company’s global turnover or even having X suspended. Insider reported last week that Musk has discussed the possibility of blocking X in Europe as a result of the EU’s regulations. Key Background SpaceX, which Musk founded in 2002, has so far emerged as the biggest player in the billionaire space race , making inroads over competitors Jeff Bezos’ Blue Origin and Richard Branson’s Virgin Galactic. While its manned space missions have faced larger issues, with its Starship rocket—which aims to one day transport astronauts to the moon—now under federal review after it exploded during a test launch in April, SpaceX has had greater luck launching satellites into orbit. The company has launched rockets containing satellites nearly every week since 2019, the New York Times reported in July, largely thanks to Starlink, SpaceX’s satellite internet offshoot consisting of satellites operating in “low-earth orbit” that now provides internet services in more than 50 countries. The company’s satellites account for more than 50% of all active satellites in orbit, according to the Times . SpaceX and Starlink have worked with a number of governments as a result, including the Department of Defense and providing internet coverage in Ukraine since its war with Russia began. The Times notes other governments have been wary about working with the company amid concerns about Musk, however, including his business ties to China and being “beholden to his whims and desires”—as evidenced by Musk reportedly restricting Starlink access in Ukraine (which he denies ). Further Reading SpaceX Signs Deal to Launch Key European Satellites (Wall Street Journal) Elon Musk’s Unmatched Power in the Stars (New York Times) EU Investigates Musk’s X Over Handling Of Israel-Hamas Disinformation (Forbes) SpaceX’s Starlink Revenue Jumps To $1.4 Billion But Falls Short Of Early Targets, Report Says—As Musk-Ukraine Controversy Brews (Forbes) Follow me on Twitter . Send me a secure tip . Alison Durkee Editorial Standards Print Reprints & Permissions",
      "pubDate": "2023-10-23 11:25:16",
      "image_url": "https://imageio.forbes.com/specials-images/imageserve/6536526f53e6b0bb3f9189f1/0x0.jpg?width=960&precrop=3099%2C1742%2Cx0%2Cy39",
      "source_id": "forbescrypto",
      "source_priority": 57,
      "country": [
        "united states of america"
      ],
      "category": [
        "business"
      ],
      "language": "english"
    },
    {
      "article_id": "9e114880d8a52d65db249b6a700651c3",
      "title": "PlayStation has been hit with a round of layoffs, former employees reveal",
      "link": "https://www.techradar.com/gaming/playstation/playstation-has-been-hit-with-a-round-of-layoffs-former-employees-reveal",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Some former PlayStation employees have revealed that the company has been hit with a round of layoffs.",
      "content": "PlayStation has been impacted by a round of layoffs, former employees have revealed. As reported by Eurogamer and VGC , in the last few days, a number of former employees have taken to social media to announce that they have been laid off from their jobs, including senior level designer Daniel Bellemare, who was working on an unannounced project at PlayStation. Previously, Bellemare worked at Ubisoft as a world designer on Assassin’s Creed Valhalla and Immortals Fenyx Rising . “Unfortunately, following a wave of layoffs last week was my last at PlayStation,” Bellemare wrote on LinkedIn. “While this is certainly not news I was hoping for, I'm grateful to have had a chance to work amongst extremely talented colleagues on incredible projects and I'm leaving with good memories of my time there.” Also impacted is former senior technical recruiter Matt Barney, who wrote : “Goodbye PlayStation / Sony Interactive Entertainment, it's been real! For the past few months, I knew this layoff wave was coming. I love PlayStation and I always will… I mean, I stayed when I had the chance to leave, so obviously!” Barney continued: “To those of you within my former organization that have been impacted today, I wish you the best of luck in your own layoff! [...] This is not the first time that I’ve been included in a layoff in games… to those of you struggling, keep at it. This sucks for sure, but keep fighting the good fight!” At the time of writing, it’s not known how many people have been impacted by these layoffs, and no official statement has been released by the company. TRG has reached out to Sony for a comment on the situation. PlayStation is far from the only games company to have been impacted by layoffs lately. Last month, it was announced that Epic Games - the developer behind Fortnite , one of the best battle royale games and one of the best free games - was laying off around 16% of its workforce.",
      "pubDate": "2023-10-23 10:55:02",
      "image_url": null,
      "source_id": "techradar",
      "source_priority": 607,
      "country": [
        "australia",
        "india"
      ],
      "category": [
        "technology"
      ],
      "language": "english"
    },
    {
      "article_id": "7f01b0a75d769f15b5156c1ff65c3264",
      "title": "Fans throw sachet water to protest decision to award Nations FC a penalty",
      "link": "https://newsghana.com.gh/fans-throw-sachet-water-to-protest-decision-to-award-nations-fc-a-penalty/",
      "keywords": [
        "Sports",
        "Abrankese",
        "Abrankese (Ash)",
        "Ashanti Derby",
        "GNA",
        "Kotoko",
        "Nasty scenes",
        "Nations FC share spoils"
      ],
      "creator": [
        "GNA"
      ],
      "video_url": null,
      "description": "News Ghana, Latest Updates and Breaking News of Ghana, GNA, https://newsghana.com.gh/fans-throw-sachet-water-to-protest-decision-to-award-nations-fc-a-penalty/There was about a 15-minute hold at the Dr. Kwame Kyei Sports Complex after referee Abdul Latif Kadri awarded a late penalty to Nations FC in their match week six encounter with Asante Kotoko in the betPawa Premier League. The traveling fans who felt the penalty was dubious threw sachet water on the pitch to […] News Ghana, Latest Updates and Breaking News of Ghana, GNA, https://newsghana.com.gh/fans-throw-sachet-water-to-protest-decision-to-award-nations-fc-a-penalty/",
      "content": "There was about a 15-minute hold at the Dr. Kwame Kyei Sports Complex after referee Abdul Latif Kadri awarded a late penalty to Nations FC in their match week six encounter with Asante Kotoko in the betPawa Premier League. The traveling fans who felt the penalty was dubious threw sachet water on the pitch to protest the decision, bringing proceedings to a temporary halt. It took the technical team of Kotoko led by Dr. Prosper Nartey Ogum to appeal to the supporters to calm down before the penalty was taken. The penalty which turned out to be the last action of the match cancelled Kotoko’s lead, bringing the final score to two goals apiece in a fiercely contested regional derby. Asante Kotoko was the first to make an attempt at goal after five minutes, but Sherrif Mohammed’s long drive from 30 yards went wide. Nations FC responded almost immediately at the other end of the pitch, but their swift build-up from the right flank was thwarted by Nana Banyin Amoah whose area appeared to be the main channel for the onslaughts of the home team in the early stages. The first quarter of an hour saw both teams keeping the ball on the turf as they exploited spaces in each other’s half in search of the opener. As both teams exhibited tactical discipline in their quest to outsmart each other, only a few chances were created at both ends of the field with Nations looking more purposeful upfront. It was virtually a midfield battle which was slightly dominated by the home team who appeared more determined to secure the three maximum points, but they were not clinical in the final third of the pitch. The Porcupines however had a glorious opportunity to break the deadlock against the run of play on the 45th minute when Kalou Ouattara’s goal-bound effort was saved by goalkeeper Rabin Ousmane. The match remained barren after two additional minutes as referee Abdul Latif Kadir brought proceedings to an end for the first half. Nations FC would however break the deadlock five minutes into the second half through Amidou Diarra who directed a corner kick into the net with a powerful header. They continued to raid the vital area of the visitors after the goal, forcing Danlad Ibrahim to make a point-blank save to keep Kotoko in the game. After enduring about 10 minutes of incessant attacks, Asante Kotoko stepped up their game, injecting some sense of urgency into their play as they strived to pull parity. Their effort paid off in the 86th minute when Steve Dese Mukwala hit the back of the net from close range after a double save by goalkeeper Ousmane. The Porcupines scored their second goal five minutes later when Michael Kyei Dwamena finished a swift attack involving four Kotoko players. Just when everyone thought Kotoko was on the verge of running away with the three points, the referee awarded a penalty to Nations FC to the dismay of the away fans who expressed their displeasure by throwing sachet water and other objects onto the field. Amidou stepped forward after a 15-minute hold-up to send Danlad in the wrong direction to earn the home team a point.",
      "pubDate": "2023-10-23 10:41:12",
      "image_url": null,
      "source_id": "newsghana",
      "source_priority": 990512,
      "country": [
        "ghana"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    },
    {
      "article_id": "b168bcbdcab4cd1194bc9b13fa4ebadb",
      "title": "Marathon Gold Provides Third Quarter 2023 Construction Report",
      "link": "https://www.cbj.ca/marathon-gold-provides-third-quarter-2023-construction-report/",
      "keywords": [
        "CBJ Newsmakers"
      ],
      "creator": [
        "CBJ"
      ],
      "video_url": null,
      "description": "TORONTO, Oct. 23, 2023 (GLOBE NEWSWIRE) — Marathon Gold Corporation (“Marathon” or the “Company”; TSX: MOZ) is pleased to provide an update on progress at its 100% owned Valentine Gold Project located in central Newfoundland (the “Project”) for the quarter ended September 30, 2023. Highlights include: The Project has marked one full year of construction […]",
      "content": "TORONTO, Oct. 23, 2023 (GLOBE NEWSWIRE) — is pleased to provide an update on progress at its 100% owned Valentine Gold Project located in central Newfoundland (the “Project”) for the quarter ended September 30, 2023. Highlights include: Matt Manson, President and CEO, commented: “The summer construction season has seen rapid progress at the Valentine Gold Project. We completed earthworks at our Process Plant, and since August have been preparing concrete foundations and footings for mill equipment and the mill building. Enclosing of the grinding building is on schedule for completion before the end of the year. We have been particularly encouraged by the progress achieved at our Tailings Management Facility, the most important earthworks element of the Project. Mining of construction materials is comfortably supporting TMF progress, and we are consistently achieving all requisite engineering and geotechnical standards. Our cost and schedule-to-complete estimates remain consistent with our previous reporting, and our procurement and detailed engineering are approaching completion. Most importantly, we are able to report a consistently safe and environmentally protected work site after one full year of construction.” A video showing 12 months of construction at the Project is available at . During the third quarter, earthworks excavations were completed at the location of the SAG and Ball mills, the CIL tank farm, the tailings thickener, and the crushed ore stockpile and reclaim area. All load bearing sites successfully achieved geotechnical specifications for foundations, and the first foundation concrete pours commenced in July. By September 30, 2023, all foundations had been completed, concrete work for the SAG and Ball mill’s sloped piers was well advanced (Figure 3), and concrete pours for the grinding building’s footings and piers was ongoing. To date, approximately 5,500 m of concrete has been poured at the Project. During the quarter, pads were also completed at the Mine Maintenance Facility site, the ROM stockpile, and the conveyor alignment. Earthworks excavation of the primary crusher location was completed, and construction of the crusher’s Mechanically Stabilized Earth (MSE) retaining wall with gabion baskets had commenced (Figure 3). Ongoing civils works at the process plant site through the fourth quarter will include the completion of the SAG and Ball mill’s piers, completion of the grinding building wall footings, completion of the MSE wall, and the pouring of lean concrete and foundations for the primary crusher pad. Structural steel for the grinding building’s exterior frame has been delivered to site, with enclosing of the building scheduled for the end of the year. Mining during the Project’s construction period is ongoing to generate rock for haul roads, pads and the TMF. During the third quarter, overburden removal and mining was transferred to the Marathon Pit due to its close proximity to the TMF. Overburden stripped was consistent with forecast, and pioneer mining proceeded quickly to the establishment of the first mining benches. During the third quarter, a total of 1.56 Mtonnes of material was moved, representing an average daily mining volume of 17,000 tonnes/day. Project-to-date, 3.4 Mtonnes of waste rock construction material and 481 ktonnes of overburden material had been mined, slightly exceeding forecast targets. Project to date, cumulative mining costs are C$5.44/tonne compared to a budget C$5.32/tonne. Mining costs are trending lower as high productivities are achieved consistently, and averaged C$4.93/tonne during the third quarter. The Project’s TMF will be a thickened tailings facility with a capacity of 31.6 Mtonnes. It is formed by constructing a perimeter zoned rockfill embankment dam, which will be raised in 6 phases during the first 10 years of the Project. The upstream face of the dam will be lined with a geomembrane which is anchored into low-permeability foundation till, and which will extend approximately 100m upstream of the dam toe and overlay granular crushed rock filter layers. Construction of the Phase 1 main dam commenced in July with preparation of the till and bedrock foundation, and subsequent placement of mine waste rock (“Zone 6” material with 600 mm minus sizing). As of September 30, 2023, 98% of the main dam footprint had been excavated, and 96% of the Zone 6 rockfill had been placed, having achieved geotechnical subgrade approval. Production and placement of the upstream filter layers which consists of two zones of crushed rock (“Zone 1” material at 25 mm minus, and “Zone 2” material at 75 mm minus) commenced in late August. As of September 30, 2023, 90% of the subgrade material underlying the upstream filter layer had been excavated, and 27% of the Zone 1 and Zone 2 crushed granular fill had been placed (Figure 4). Geomembrane liner deliveries commenced during the quarter, with installation scheduled to commence in the second quarter of 2024. During the quarter, the final dormitory of the permanent camp was completed and approved for occupancy, bringing total bed capacity to 424. Average camp occupancy during September was between 280 and 340 persons. Excess camp capacity is available if required in support of the construction schedule. The Project’s 66 kV powerline has been completed over its full 40 km length and ready to be connected to the on-site transformer station (Figure 5). Subsequent to the quarter end, modifications to the NL Hydro Star Lake Generating Station hook-up commenced, as well as installation of the Project site’s power distribution network. The Project site is expected to be energised, on budget and schedule, prior to the end of the year. This means that mill construction and camp operations in 2024 will be on grid power, minimising the need for diesel generators and limiting on-site fuel requirements to the mobile mining fleet and the TMF construction contractor. 91% of NL Hydro’s power is generated from renewable, hydroelectric sources, giving the Valentine Gold Project a comparatively low carbon footprint compared to similarly sized mining projects. During the third quarter, upgrades to the Project’s 80 km access road from Millertown commenced, so as to provide greater reliability during the spring 2024 construction season and into mine operations. This work has included culvert installation, ditching, raising of the road-bed and applying new road top coats of crushed rock. This work is being carried out by a local contractor based in the community of Millertown and is proceeding well (Figure 5). The 80km road from Millertown to the Valentine Gold Project is public infrastructure, and with its connection to the historic Burgeo Highway it provides an alternate cross-Newfoundland vehicle route. Marathon’s investment in this road, including the 2022 replacement of the Victoria River Bridge, creates a significant societal and economic benefit for the Province of Newfoundland and Labrador. Detailed engineering is substantially complete on all aspects of the Project, with the exception of additional design hours to accommodate certain changes to mill building design in the areas of concrete, structural & layout design described in Marathon’s Second Quarter report (see Marathon news release dated 2 August, 2023). Procurement stands at approximately 72% complete. Marathon reports procurement on the basis of all Project goods and services on an earned progress basis. All long-lead items, including major mill components and the Project’s mobile mining fleet, have been procured. The SAG and Ball mills, including motors, are expected to be delivered to the site in the first quarter of 2024. Major construction packages remaining outstanding at the quarter end were the Structural, Mechanical and Piping, and Electrical and Instrumentation packages for the mill. The Project remains on schedule to achieve mill commissioning in the fourth quarter of 2024 and first gold in the first quarter of 2025. The Project’s critical path is the development of the process plant, including its foundations, building enclosure, equipping, and commissioning as well as the TMF. Earthworks associated with the development of the TMF are scheduled over two summer construction seasons and one winter season so as to allow operating tailings commissioning in the second half of 2024. Capital costs incurred from the start of early works in October 2022 to the end of September 2023 were C$190 million with C$318 million committed (excluding sunk costs of C$71 million incurred prior to October 2022). The Project’s cost to complete, including contingency, was estimated at C$463 million as at October 31, 2022 and $318 million at September 30, 2023. As at September 30, 2023, Marathon had approved contingency draws of C$13.2 million from a total contingency reserve of C$38.9 million. Unused contingency stood at C$25.7 million, or 66%. Contingency draws are approved on a package-by-package basis as construction proceeds. During the quarter, C$3.9 million of unused contingency on finalised construction packages was transferred to the Management Reserve, which now stands at C$4.1 million. At the end of September 30, 2023, 634 persons were employed directly or contracted to the Project. Marathon collects diversity employment data on the basis of voluntary declaration. On this basis, 15% of the persons employed by the Project are female and 8% are Indigenous persons. 23% are residents of the six communities within the Project’s socio-economic area of influence (Millertown, Buchans, Buchans Junction, Grand Falls Windsor, Badger and Bishop’s Falls) and 85% are residents of the province of Newfoundland and Labrador. The Valentine Gold Project was released from its Newfoundland and Labrador Environmental Assessment (“EA”) on March 17, 2022, and its federal EA process on August 24, 2022. Permitting for specific site activities has continued throughout the mine development process in accordance with the construction schedule. At the end of September 30, 2023, overall permitting progress stood at 97% complete, with site permitting proceeding smoothly in support of the construction schedule. The Berry Complex (pit, waste rock facility and associated infrastructure) is subject to further EA requirements to identify, assess and mitigate potential environmental effects during all project phases, including construction, operation, decommissioning, rehabilitation and closure, and post-closure. Marathon filed EA registration materials for Berry with the Newfoundland and Labrador Department of Environment and Climate Change, EA Division, (“NLDECC”) and the Impact Assessment Agency of Canada (“IAAC”) on August 11, 2023, following the completion of an effects assessment and consultation with both the provincial and federal regulators, Indigenous groups, communities, and stakeholder organizations. In late August 2023, Marathon was informed by IAAC that changes to the Project to accommodate Berry do not require a new impact assessment under the (“IAA”). This means that, federally, the addition of the Berry Complex is considered a change to the Designated Project referenced in the August 2022 Decision Statement of the Minister of Environment and Climate Change Canada, and potential amendments to the Decision Statement are now being considered. Provincially, the assessment of Berry is considered a “new undertaking” and requires the submission of a new EA registration with the NLDECC. Marathon expects to be notified shortly by the NL Minister of Environment and Climate Change if additional information is required to complete the provincial assessment process, which is expected take the form of an Environmental Preview Report. Marathon anticipates the Berry review processes will be completed during 2023 and 2024, well in advance of the scheduled commencement of mining at Berry in the second quarter of 2025. Disclosure of a scientific or technical nature in this news release has been approved by Mr. Paolo Toscano, P.Eng. (Ont.), Senior Vice President, Projects, Engineering and Construction for Marathon, Mr. James Powell, P.Eng. (NL), Vice President, Regulatory and Government Affairs for Marathon and Mr. David Ross, P.Geo. (NL), Vice President of Geology and Exploration for Marathon. Mr. Toscano, Mr. Powell and Mr. Ross are qualified persons under National Instrument (“NI”) 43-101. Marathon (TSX:MOZ) is a Toronto based gold company advancing its 100%-owned Valentine Gold Project located in the central region of Newfoundland and Labrador, one of the top mining jurisdictions in the world. The Project comprises a series of five mineralized deposits along a 32-kilometre system. A December 2022 Updated Feasibility Study outlined an open pit mining and conventional milling operation producing 195,000 ounces of gold a year for 12 years within a 14.3-year mine life. The Project was released from federal and provincial environmental assessment in 2022 and construction commenced in October 2022. The Project has estimated Proven Mineral Reserves of 1.43 Moz (23.36 Mt at 1.89 g/t) and Probable Mineral Reserves of 1.27 Moz (28.22 Mt at 1.40 g/t). Total Measured Mineral Resources (inclusive of the Mineral Reserves) comprise 2.06 Moz (29.23 Mt at 2.19 g/t) with Indicated Mineral Resources (inclusive of the Mineral Reserves) of 1.90 Moz (35.40 Mt at 1.67 g/t). Additional Inferred Mineral Resources are 1.10 Moz (20.75 Mt at 1.65 g/t Au). Please see the NI 43-101 Technical Report “Valentine Gold Project, NI 43-101 Technical Report and Feasibility Study” effective November 30, 2022, Marathon’s Annual Information Form for the year ended December 31, 2022 and other filings made with Canadian securities regulatory authorities available at for further details and assumptions relating to the Valentine Gold Project. To find out more information on Marathon Gold Corporation and the Valentine Gold Project, please visit . Photos accompanying this announcement are available:",
      "pubDate": "2023-10-23 10:30:00",
      "image_url": null,
      "source_id": "cbj",
      "source_priority": 845117,
      "country": [
        "canada"
      ],
      "category": [
        "top"
      ],
      "language": "english"
    }
  ],
  "nextPage": "1698057000193989624"
}